// Вывести квадрат числа
/* int a = new Random().Next (0,10);
Console.WriteLine(a);
int APowerTwo = 0;
APowerTwo=a*a;
Console.WriteLine(APowerTwo); */

// на семинаре предложено такое решение
double a;
string s = Console.ReadLine();
a=Convert.ToInt32(s);
Console.WriteLine(Math.Pow(a,2));


